programming/interview/interview.html
---
title: "Interview"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-11 Tue 16:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Interview</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Victor Chen" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Interview</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org85a050e">1 Strategy for Software Engineering Position Interview</a>
<ul>
<li><a href="#org8798eae">1.1 Rephrasing</a></li>
<li><a href="#org61d5cc6">1.2 Visual Model</a></li>
<li><a href="#org24803ab">1.3 Using Cases</a></li>
<li><a href="#orgad0902d">1.4 Baseline Solution</a></li>
<li><a href="#org24785a0">1.5 Improved Solution</a>
<ul>
<li><a href="#org879a2d0">1.5.1 Divide and Conquer</a></li>
<li><a href="#org32d7b76">1.5.2 Transformation</a></li>
<li><a href="#org59b5f18">1.5.3 Recursion</a></li>
<li><a href="#org809f411">1.5.4 Greedy Method</a></li>
<li><a href="#orgf9a386b">1.5.5 Approximation</a></li>
</ul>
</li>
<li><a href="#org6419bee">1.6 Keep Talking</a></li>
<li><a href="#org0a5cc40">1.7 Generalization</a></li>
<li><a href="#org0ab0647">1.8 Links</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org85a050e" class="outline-2">
<h2 id="org85a050e"><span class="section-number-2">1</span> Strategy for Software Engineering Position Interview</h2>
<div class="outline-text-2" id="text-1">
<p>
Employers are generally looking at 5 areas when hiring a software engineer:
</p>

<ol class="org-ol">
<li>Technical knowledge of specific technology product.</li>
<li>Experience of the business problem domain.</li>
<li>General technical and architecture sense.</li>
<li>Personality and working style.</li>
<li>IQ, problem solving skills.</li>
</ol>

<p>
While 1 to 4 are straightforward, the most interesting and challenging is the item 5. Depending on how good you can manage pressure, your brain can be totally blank at the interview.
</p>

<p>
A short interview doesn't necessarily reflects a person's ability in actual work. There is a factor of luck involved in this process. Nevertheless, most employers are willing to accept a higher false negative (positive as qualified for the position, and negative as unqualified) rate, to keep the false positive rate very low.
</p>

<p>
There is no trick in gaining good knowledge, high IQ and the ability to speak and think under pressure, but I've found some useful techniques and strategies.
</p>
</div>

<div id="outline-container-org8798eae" class="outline-3">
<h3 id="org8798eae"><span class="section-number-3">1.1</span> Rephrasing</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Rephrase the question slowly in your own words. This can help to make sure you fully understand the question, and clarify if there is any hidden assumption you have made. Repeat the question slowly also gives you more time to think. From the interview perspective, they can see the candidate's ability to digest a problem.
</p>
</div>
</div>

<div id="outline-container-org61d5cc6" class="outline-3">
<h3 id="org61d5cc6"><span class="section-number-3">1.2</span> Visual Model</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Construct a visual model of the problem. Use a whiteboard or paper to diagram the problem. Our brain is better in understanding visual information than textual. From an interview's perspective, they can see a clear picture of how you analyze the problem.
</p>
</div>
</div>

<div id="outline-container-org24803ab" class="outline-3">
<h3 id="org24803ab"><span class="section-number-3">1.3</span> Using Cases</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Never try to tackle the general problem at first, start with a simple, special case, and see how you would solve it first. This reduces the complexity of the problem, and lets you focus on the core of it.
</p>
</div>
</div>

<div id="outline-container-orgad0902d" class="outline-3">
<h3 id="orgad0902d"><span class="section-number-3">1.4</span> Baseline Solution</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Start with a naive (usually brute-force) solution to establish a baseline. Analyze the complexity of this naive solution for future comparison with improved solutions.
</p>
</div>
</div>

<div id="outline-container-org24785a0" class="outline-3">
<h3 id="org24785a0"><span class="section-number-3">1.5</span> Improved Solution</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-org879a2d0" class="outline-4">
<h4 id="org879a2d0"><span class="section-number-4">1.5.1</span> Divide and Conquer</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Decompose the problem into smaller ones, and solve each separately, then combine the results for the overall problem.
</p>
</div>
</div>

<div id="outline-container-org32d7b76" class="outline-4">
<h4 id="org32d7b76"><span class="section-number-4">1.5.2</span> Transformation</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
Try to model the problem by well-studied data structures (e.g. tree, graph) and models (e.g. search, sort), and apply corresponding algorithms to solve them.
</p>
</div>
</div>

<div id="outline-container-org59b5f18" class="outline-4">
<h4 id="org59b5f18"><span class="section-number-4">1.5.3</span> Recursion</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
Try to structure the problem in a recursive form, by solving the base case and expanding the solution in a recursive manner.
</p>
</div>
</div>

<div id="outline-container-org809f411" class="outline-4">
<h4 id="org809f411"><span class="section-number-4">1.5.4</span> Greedy Method</h4>
<div class="outline-text-4" id="text-1-5-4">
<p>
Try to modify attributes of current best solution to see if you can get a better one. Don't be trapped in a local optimal solution.
</p>
</div>
</div>

<div id="outline-container-orgf9a386b" class="outline-4">
<h4 id="orgf9a386b"><span class="section-number-4">1.5.5</span> Approximation</h4>
<div class="outline-text-4" id="text-1-5-5">
<p>
Instead of finding the exact solution, see if it is acceptable to find an approximate solution. For example, a probabilistic approach to try 100 random combinations and pick the best outcome.
</p>
</div>
</div>
</div>

<div id="outline-container-org6419bee" class="outline-3">
<h3 id="org6419bee"><span class="section-number-3">1.6</span> Keep Talking</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Keep talking while you are thinking about the solution, so the interviewer understands how you analyze things. You can also show how well you can express your thoughts. It is also easier for the interviewer to guide you or give hints.
</p>
</div>
</div>

<div id="outline-container-org0a5cc40" class="outline-3">
<h3 id="org0a5cc40"><span class="section-number-3">1.7</span> Generalization</h3>
<div class="outline-text-3" id="text-1-7">
<p>
After finding a working solution for the simple case, extend it and see if you can find a general pattern, and generalize the solution for the general problem. From the interview's perspective, they can assess the candidate's ability in thinking in different levels of abstraction, and the ability to apply a solution in a broader range of problems.
</p>
</div>
</div>

<div id="outline-container-org0ab0647" class="outline-3">
<h3 id="org0ab0647"><span class="section-number-3">1.8</span> Links</h3>
<div class="outline-text-3" id="text-1-8">
<ol class="org-ol">
<li><a href="http://horicky.blogspot.com/2010/06/strategy-for-software-engineering.html">Strategy for Software Engineering Position Interview</a></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Victor Chen</p>
<p class="date">Created: 2020-02-11 Tue 16:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
